app/controllers/company_profiles_controller.rb

SELECT "company_profiles".* FROM "company_profiles"
---
  def index
    @company_profiles = CompanyProfile.all

SELECT  "company_profiles".* FROM "company_profiles" WHERE "company_profiles"."id" = $1 LIMIT 1  [["id", 13]]
---
  def set_company_profile
    company_profile = CompanyProfile.find(params[:id])